# YOLOv11 + GL-YOMO enhancements
# Includes: Ghost modules, CPAM attention, TFE, enhanced small object detection

nc: 80  # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone with Ghost modules for efficiency
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, GhostConv, [128, 3, 2]]     # 1-P2/4 (Ghost for efficiency)
  - [-1, 2, C3Ghost, [128, 1, False]]   # 2
  - [-1, 1, GhostConv, [256, 3, 2]]     # 3-P3/8
  - [-1, 2, C3_SAC, [256, 1, False]]    # 4 (n=1, shortcut=False)
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3_SAC, [512, 1, False]]    # 6
  - [-1, 1, CPAM, [512, 16]]            # 7 (Channel+Position Attention)
  - [-1, 1, Conv, [1024, 3, 2]]         # 8-P5/32
  - [-1, 2, C3Ghost, [1024, 1, False]]  # 9 (Ghost to reduce compute)
  - [-1, 1, SPPF, [1024, 5]]            # 10
  - [-1, 1, TFE, [512]]                 # 11 (Triple Feature Encoder, output 512)

# Neck with multi-scale fusion
neck:
  - [-1, 1, Conv, [512, 1, 1]]                    # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 13
  - [[-1, 6], 1, AdaptiveConcat, [512]]           # 14
  - [-1, 2, C3_SAC, [512, 1, False]]              # 15
  - [-1, 1, Conv, [256, 1, 1]]                    # 16
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 17
  - [[-1, 4], 1, AdaptiveConcat, [256]]           # 18
  - [-1, 2, C3_SAC, [256, 1, False]]              # 19
  - [-1, 1, CPAM, [256, 16]]                      # 20 (attention for small objects)
  
  # Additional P2 head for very small objects
  - [-1, 1, Conv, [128, 1, 1]]                    # 21
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 22
  - [[-1, 2], 1, AdaptiveConcat, [128]]           # 23 (connect to P2)
  - [-1, 2, C3_SAC, [128, 1, False]]              # 24 P2 features

# Head with P2, P3, P4, P5 detection (4 scales for small objects)
head:
  # Bottom-up path
  - [-1, 1, Conv, [128, 3, 2]]                    # 25
  - [[-1, 19], 1, AdaptiveConcat, [256]]          # 26
  - [-1, 2, C3Ghost, [256, 1, False]]             # 27 P3
  
  - [-1, 1, Conv, [256, 3, 2]]                    # 28
  - [[-1, 15], 1, AdaptiveConcat, [512]]          # 29
  - [-1, 2, C3Ghost, [512, 1, False]]             # 30 P4
  
  - [-1, 1, Conv, [512, 3, 2]]                    # 31
  - [[-1, 11], 1, AdaptiveConcat, [1024]]         # 32
  - [-1, 2, C3Ghost, [1024, 1, False]]            # 33 P5
  
  # Detection heads: P2(24), P3(27), P4(30), P5(33)
  - [[24, 27, 30, 33], 1, Detect, [nc]]           # 34 Detect with 4 scales
